STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco.c
/**
  ******************************************************************************
  * @file    stm32mp215f_disco.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage
  *          LEDs
  *          push-buttons
  *          COM ports
  *          available on STM32MP215F_DK board (MB2059) from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp215f_disco.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP215F_DK
  * @{
  */

/** @defgroup LOW_LEVEL LOW LEVEL
  * @{
  */

/** @defgroup Private_TypesDefinitions  Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback)(void);
/**
  * @}
  */

/** @defgroup Private_FunctionPrototypes  Private Function Prototypes
  * @{
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
static void BUTTON_WAKEUP_EXTI_Callback(void);
static void BUTTON_USER1_EXTI_Callback(void);
static void BUTTON_USER2_EXTI_Callback(void);
static void BUTTON_TAMPER_EXTI_Callback(void);
static int32_t BSP_LED_MspInit(Led_TypeDef Led);
static int32_t BSP_LED_MspDeInit(Led_TypeDef Led);
static int32_t BSP_PB_MspInit(Button_TypeDef Button);
static int32_t BSP_PB_MspDeInit(Button_TypeDef Button);
#endif /* CORE_CA35 || CORE_CM33 */
#if (USE_BSP_COM_FEATURE > 0)
static void USART_MspInit(UART_HandleTypeDef *huart);
static void USART_MspDeInit(UART_HandleTypeDef *huart);
#endif /* (USE_BSP_COM_FEATURE > 0) */
/**
  * @}
  */

/** @defgroup Exported_Variables Exported Variables
  * @{
  */
EXTI_HandleTypeDef hpb_exti[BUTTONn];

#if (USE_BSP_COM_FEATURE > 0)
UART_HandleTypeDef hcom_uart[COMn];
USART_TypeDef *COM_USART[COMn] = { COM_CA35_UART, COM_CM33_UART };
#endif /* (USE_BSP_COM_FEATURE > 0) */
/**
  * @}
  */

/** @defgroup Private_Variables Private Variables
  * @{
  */
#if defined (CORE_CA35) || defined (CORE_CM33)
static GPIO_TypeDef *LED_PORT[LEDn] = {
                                        LED1_GPIO_PORT,
                                        LED2_GPIO_PORT,
                                        LED3_GPIO_PORT,
                                        LED4_GPIO_PORT
                                      };

static const uint32_t LED_PIN[LEDn] = {
                                        LED1_PIN,
                                        LED2_PIN,
                                        LED3_PIN,
                                        LED4_PIN
                                      };

static const GPIO_PinState GPIO_LED_OFF[LEDn] = {
                                                  GPIO_PIN_SET,
                                                  GPIO_PIN_RESET,
                                                  GPIO_PIN_RESET,
                                                  GPIO_PIN_RESET
                                                };

static const GPIO_PinState GPIO_LED_ON[LEDn] = {
                                                  GPIO_PIN_RESET,
                                                  GPIO_PIN_SET,
                                                  GPIO_PIN_SET,
                                                  GPIO_PIN_SET
                                               };

static const ResMgr_Res_Type_t LED_RIF_RES_TYPn[LEDn] = {
                                                        LED1_GPIO_RIF_RES_TYP_GPIO,
                                                        LED2_GPIO_RIF_RES_TYP_GPIO,
                                                        LED3_GPIO_RIF_RES_TYP_GPIO,
                                                        LED4_GPIO_RIF_RES_TYP_GPIO
                                                      };

static const uint8_t LED_RIF_RES_NUMn[LEDn] = {
                                                LED1_GPIO_RIF_RES_NUM_GPIO,
                                                LED2_GPIO_RIF_RES_NUM_GPIO,
                                                LED3_GPIO_RIF_RES_NUM_GPIO,
                                                LED4_GPIO_RIF_RES_NUM_GPIO
                                              };

static GPIO_TypeDef *BUTTON_PORT[BUTTONn] = {
                                              BUTTON_WAKEUP_GPIO_PORT,
                                              BUTTON_USER1_GPIO_PORT,
                                              BUTTON_USER2_GPIO_PORT,
                                              BUTTON_TAMPER_GPIO_PORT
                                            };

static const uint16_t BUTTON_PIN[BUTTONn] = {
                                              BUTTON_WAKEUP_PIN,
                                              BUTTON_USER1_PIN,
                                              BUTTON_USER2_PIN,
                                              BUTTON_TAMPER_PIN
                                            };

static const IRQn_Type BUTTON_IRQn[BUTTONn] = {
                                                BUTTON_WAKEUP_EXTI_IRQn,
                                                BUTTON_USER1_EXTI_IRQn,
                                                BUTTON_USER2_EXTI_IRQn,
                                                BUTTON_TAMPER_EXTI_IRQn
                                              };

static const ResMgr_Res_Type_t BUTTON_RIF_RES_TYPn[BUTTONn] = {
                                                        BUTTON_WAKEUP_RIF_RES_TYP_GPIO,
                                                        BUTTON_USER1_RIF_RES_TYP_GPIO,
                                                        BUTTON_USER2_RIF_RES_TYP_GPIO,
                                                        BUTTON_TAMPER_RIF_RES_TYP_GPIO
                                                      };

