STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco.c
static const uint8_t BUTTON_RIF_RES_NUMn[BUTTONn] = {
                                                        BUTTON_WAKEUP_RIF_RES_NUM_GPIO,
                                                        BUTTON_USER1_RIF_RES_NUM_GPIO,
                                                        BUTTON_USER2_RIF_RES_NUM_GPIO,
                                                        BUTTON_TAMPER_RIF_RES_NUM_GPIO
                                                      };

#endif /* CORE_CA35 || CORE_CM33 */

#if (USE_COM_LOG > 0)
/* define default active port to port dedicated to current Core
 * This is important for Validation applications which are not explicitly setting active log port */
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif /* (USE_COM_LOG > 0) */

#if (USE_BSP_COM_FEATURE > 0)
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t IsComMspCbValid[COMn] = {0};
#endif /* (USE_HAL_UART_REGISTER_CALLBACKS == 0) */
#endif /* (USE_BSP_COM_FEATURE > 0) */

/**
  * @}
  */

/** @defgroup Exported_Functions Exported Functions
  * @{
  */

/**
  * @brief  This method returns the STM32MP215FXX DK BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return (int32_t)STM32MP215F_DK_BSP_VERSION;
}

/**
  * @brief  This method returns the board name
  * @retval pointer to the board name string
  */
const uint8_t *BSP_GetBoardName(void)
{
  return (uint8_t *)STM32MP215F_DK_BSP_BOARD_NAME;
}

/**
  * @brief  This method returns the board ID
  * @retval pointer to the board name string
  */
const uint8_t *BSP_GetBoardID(void)
{
  return (uint8_t *)STM32MP215F_DK_BSP_BOARD_ID;
}

#if defined (CORE_CA35) || defined (CORE_CM33)
/**
  * @brief  Configures LED on GPIO.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*BSP LED Msp Init Configuration*/
  if (BSP_LED_MspInit(Led) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_MSP_FAILURE;
  }

  /* Configure the GPIO_LED pin */
  GPIO_InitStruct.Pin = LED_PIN[Led];
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

  HAL_GPIO_Init(LED_PORT[Led], &GPIO_InitStruct);

  /* By default, turn off LED */
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_LED_OFF[Led]);
  return ret;
}

/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef  gpio_init_structure;

  /* DeInit the GPIO_LED pin */
  gpio_init_structure.Pin = LED_PIN [Led];
  /* Turn off LED */
  HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN[Led], GPIO_LED_OFF[Led]);
  HAL_GPIO_DeInit(LED_PORT [Led], gpio_init_structure.Pin);

  /* BSP LED  MSP DeInit configuration*/
  if (BSP_LED_MspDeInit(Led) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_MSP_FAILURE;
  }

  return ret;
}

/**
  * @brief  MspInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval int32_t
  */
static int32_t BSP_LED_MspInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Enable the GPIO_LED clock */
  if ((Led == LED1) && !(LED1_GPIO_IS_CLK_ENABLED()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(97)))
    {
      LED1_GPIO_CLK_ENABLE();
    }
  }
  else if ((Led == LED2) && !(LED2_GPIO_IS_CLK_ENABLED()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(95)))
    {
      LED2_GPIO_CLK_ENABLE();
    }
  }
  else if ((Led == LED3) && !(LED3_GPIO_IS_CLK_ENABLED()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(97)))
    {
      LED3_GPIO_CLK_ENABLE();
    }
  }
  else if ((Led == LED4) && !(LED4_GPIO_IS_CLK_ENABLED()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(101)))
    {
      LED4_GPIO_CLK_ENABLE();
    }
  }

  if (!IS_DEVELOPER_BOOT_MODE())
  {
    if (ResMgr_Request(LED_RIF_RES_TYPn[Led], LED_RIF_RES_NUMn[Led]) != RESMGR_STATUS_ACCESS_OK)
    {
      ret = BSP_ERROR_MSP_FAILURE;
    }
  }
  return ret;
}

/**
  * @brief  MspDeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval int32_t
  */
static int32_t BSP_LED_MspDeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

  if (!IS_DEVELOPER_BOOT_MODE())
  {
    (void)ResMgr_Release(LED_RIF_RES_TYPn[Led], LED_RIF_RES_NUMn[Led]);
  }
  return ret;
}

/**
  * @brief  Turns selected LED On.
  * @param  Led LED to be set on
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_On(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

  HAL_GPIO_WritePin(LED_PORT[Led], (uint16_t)LED_PIN[Led], GPIO_LED_ON[Led]);
  return ret;
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led LED to be set off
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_Off(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  HAL_GPIO_WritePin(LED_PORT[Led], (uint16_t)LED_PIN[Led], GPIO_LED_OFF[Led]);
  return ret;
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led LED to be toggled
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_Toggle(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  HAL_GPIO_TogglePin(LED_PORT[Led], (uint16_t)LED_PIN[Led]);
  return ret;
}
/**
  * @brief  Get the selected LED state.
  * @param  Led LED to be get its state
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval LED status
  */
int32_t BSP_LED_GetState(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  ret = (int32_t)HAL_GPIO_ReadPin(LED_PORT[Led], (uint16_t)LED_PIN[Led]);
  return ret;
}

/**
  * @brief  Configures button GPIO and EXTI Line.
  * @param  Button Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  * @param  ButtonMode Button mode
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_MODE_GPIO: Button will be used as simple IO
  *            @arg  BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                                    with interrupt generation capability
  * @retval BSP status
  */
int32_t  BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpio_init_structure;
  static BSP_EXTI_LineCallback ButtonCallback[BUTTONn] = {
                                                            BUTTON_WAKEUP_EXTI_Callback,
                                                            BUTTON_USER1_EXTI_Callback,
                                                            BUTTON_USER2_EXTI_Callback,
                                                            BUTTON_TAMPER_EXTI_Callback
                                                         };

  static uint32_t  BSP_BUTTON_PRIO [BUTTONn] = {
                                                  BSP_BUTTON_WAKEUP_IT_PRIORITY,
                                                  BSP_BUTTON_USER_IT_PRIORITY,
                                                  BSP_BUTTON_USER_IT_PRIORITY,
                                                  BSP_BUTTON_TAMPER_IT_PRIORITY
                                               };

  static const uint32_t BUTTON_EXTI_LINE[BUTTONn] = {
                                                      BUTTON_WAKEUP_EXTI_LINE,
                                                      BUTTON_USER1_EXTI_LINE,
                                                      BUTTON_USER2_EXTI_LINE,
                                                      BUTTON_TAMPER_EXTI_LINE
                                                    };

  /*BSP PB Msp Init Configuration*/
  if (BSP_PB_MspInit(Button) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_MSP_FAILURE;
  }

  gpio_init_structure.Pin = BUTTON_PIN [Button];
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;

